In [48]:
### Copy and paste top of lab 4 to extract data warehouse and its tables from SQL

import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

print(f"Running SQL Alchemy Version: {sqlalchemy.__version__}")
print(f"Running PyMongo Version: {pymongo.__version__}")

mysql_args = {
    "uid" : "root",
    "pwd" : "Qzk11$soccer15",
    "hostname" : "localhost",
    "dbname" : "adventureworks_dw"
}

def get_sql_dataframe(sql_query, **args):
    '''Connect to MySQL, run a SQL query, and return a DataFrame.'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    dframe = pd.read_sql(text(sql_query), connection)
    connection.close()
    
    return dframe

### Print tables to ensure all 4 were properly extracted from SQL  

df_test = get_sql_dataframe("SHOW TABLES;", **mysql_args)
print(df_test)

Running SQL Alchemy Version: 2.0.39
Running PyMongo Version: 4.15.3
  Tables_in_adventureworks_dw
0                dim_customer
1                    dim_date
2                 dim_product
3                  fact_sales

In [50]:
### Run each of the tables, but display only the first few data using head() to avoid data overload 
### Title each table correspondingly 

df_customer = get_sql_dataframe("SELECT * FROM dim_customer;", **mysql_args)
df_date = get_sql_dataframe("SELECT * FROM dim_date;", **mysql_args)
df_product = get_sql_dataframe("SELECT * FROM dim_product;", **mysql_args)
df_sales = get_sql_dataframe("SELECT * FROM fact_sales;", **mysql_args)

print("Customer Table")
display(df_customer.head())

print("Date Table")
display(df_date.head())

print("Product Table")
display(df_product.head())

print("Sales Table")
display(df_sales.head())

print(df_sales.shape)
print(df_sales.head(3).T)

Customer Table

   customer_key  territory_id account_number customer_type
0             1             1     AW00000001             S
1             2             1     AW00000002             S
2             3             4     AW00000003             S
3             4             4     AW00000004             S
4             5             4     AW00000005             S

Date Table

   date_key   full_date  year  month  day
0  20010701  2001-07-01  2001      7    1
1  20010702  2001-07-02  2001      7    2
2  20010703  2001-07-03  2001      7    3
3  20010704  2001-07-04  2001      7    4
4  20010705  2001-07-05  2001      7    5

Product Table

   product_key           product_name product_number  list_price
0            1        Adjustable Race        AR-5381         0.0
1            2           Bearing Ball        BA-8327         0.0
2            3        BB Ball Bearing        BE-2349         0.0
3            4  Headset Ball Bearings        BE-2908         0.0
4          316                  Blade        BL-2036         0.0

Sales Table

,sales_order_id,product_key,customer_key,date_key,quantity,unit_price,sales_amount
0,43659,776,676,20010701,1,2024.99,2024.99
1,43659,777,676,20010701,3,2024.99,6074.98
2,43659,778,676,20010701,1,2024.99,2024.99
3,43659,771,676,20010701,1,2039.99,2039.99
4,43659,772,676,20010701,1,2039.99,2039.99

(121317, 7)
                          0            1            2
sales_order_id     43659.00     43659.00     43659.00
product_key          776.00       777.00       778.00
customer_key         676.00       676.00       676.00
date_key        20010701.00  20010701.00  20010701.00
quantity               1.00         3.00         1.00
unit_price          2024.99      2024.99      2024.99
sales_amount        2024.99      6074.98      2024.99

In [51]:
### Merge sales and product tables 
df_sales_product = pd.merge(df_sales, df_product, on="product_key", how="left")

### Merge resulting table with customers table
df_sales_product_customer = pd.merge(df_sales_product, df_customer, on="customer_key", how="left")

### Merge sales, products, and customers tables with date dimension table
df_final = pd.merge(df_sales_product_customer, df_date, on="date_key", how="left")

### merged dataset
display(df_final.head())

,sales_order_id,product_key,customer_key,date_key,quantity,unit_price,sales_amount,product_name,product_number,list_price,territory_id,account_number,customer_type,full_date,year,month,day
0,43659,776,676,20010701,1,2024.99,2024.99,"Mountain-100 Black, 42",BK-M82B-42,3374.99,5,AW00000676,S,2001-07-01,2001,7,1
1,43659,777,676,20010701,3,2024.99,6074.98,"Mountain-100 Black, 44",BK-M82B-44,3374.99,5,AW00000676,S,2001-07-01,2001,7,1
2,43659,778,676,20010701,1,2024.99,2024.99,"Mountain-100 Black, 48",BK-M82B-48,3374.99,5,AW00000676,S,2001-07-01,2001,7,1
3,43659,771,676,20010701,1,2039.99,2039.99,"Mountain-100 Silver, 38",BK-M82S-38,3399.99,5,AW00000676,S,2001-07-01,2001,7,1
4,43659,772,676,20010701,1,2039.99,2039.99,"Mountain-100 Silver, 42",BK-M82S-42,3399.99,5,AW00000676,S,2001-07-01,2001,7,1

In [52]:
### Load merged table back into SQL to perform queries 

from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:Qzk11$soccer15@localhost/adventureworks_dw")

df_final.to_sql(name="fact_sales_final", con=engine, if_exists="replace", index=False)

121317

In [53]:
### Add in new csv file from excel (created own table)
df_salesperson = pd.read_csv("dim_salesperson.csv")
display(df_salesperson)

   salesperson_id first_name  last_name
0               1   Jennifer   Connally
1               2    Gerard        Cary
2               3     Lawrie   Freedman
3               4       Mary  Alexander
4               5        Jim      Davis

In [54]:
import numpy as np

df_final['salesperson_id'] = np.random.choice([1, 2, 3, 4, 5], size=len(df_final))
df_final_salesperson = pd.merge(df_final, df_salesperson, on="salesperson_id", how="left")
display(df_final_salesperson)

,sales_order_id,product_key,customer_key,date_key,quantity,unit_price,sales_amount,product_name,product_number,list_price,territory_id,account_number,customer_type,full_date,year,month,day,salesperson_id,first_name,last_name
0,43659,776,676,20010701,1,2024.99,2024.99,"Mountain-100 Black, 42",BK-M82B-42,3374.99,5,AW00000676,S,2001-07-01,2001,7,1,4,Mary,Alexander
1,43659,777,676,20010701,3,2024.99,6074.98,"Mountain-100 Black, 44",BK-M82B-44,3374.99,5,AW00000676,S,2001-07-01,2001,7,1,4,Mary,Alexander
2,43659,778,676,20010701,1,2024.99,2024.99,"Mountain-100 Black, 48",BK-M82B-48,3374.99,5,AW00000676,S,2001-07-01,2001,7,1,5,Jim,Davis
3,43659,771,676,20010701,1,2039.99,2039.99,"Mountain-100 Silver, 38",BK-M82S-38,3399.99,5,AW00000676,S,2001-07-01,2001,7,1,4,Mary,Alexander
4,43659,772,676,20010701,1,2039.99,2039.99,"Mountain-100 Silver, 42",BK-M82S-42,3399.99,5,AW00000676,S,2001-07-01,2001,7,1,3,Lawrie,Freedman
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
121312,75122,878,15868,20040731,1,21.98,21.98,Fender Set - Mountain,FE-6654,21.98,6,AW00015868,I,2004-07-31,2004,7,31,4,Mary,Alexander
121313,75122,712,15868,20040731,1,8.99,8.99,AWC Logo Cap,CA-1098,8.99,6,AW00015868,I,2004-07-31,2004,7,31,2,Gerard,Cary
121314,75123,878,18759,20040731,1,21.98,21.98,Fender Set - Mountain,FE-6654,21.98,6,AW00018759,I,2004-07-31,2004,7,31,3,Lawrie,Freedman
121315,75123,879,18759,20040731,1,159.00,159.00,All-Purpose Bike Stand,ST-1401,159.00,6,AW00018759,I,2004-07-31,2004,7,31,5,Jim,Davis
121316,75123,712,18759,20040731,1,8.99,8.99,AWC Logo Cap,CA-1098,8.99,6,AW00018759,I,2004-07-31,2004,7,31,1,Jennifer,Connally

In [55]:
df_final_salesperson.to_sql(name="fact_sales_final", con=engine, if_exists="replace", index=False)

121317